# -*- coding:utf-8 -*-
'''
    定义测试程序运行控制程序
'''
import os, sys  
import importlib  
from lpt.lib import lptlog

def run(tool, jobs_xml, job_node, clean=False):
    '''定义测试流程
    '''
    module = 'lpt.tests.%s' % tool
    mo = importlib.import_module(module)
    test = mo.TestControl(jobs_xml, job_node, tool)
    
    #测试准备
    lptlog.info('''
               --------------------------------------------------------------
              +                第一步:测试准备...                           +
               --------------------------------------------------------------
''')
    test.check_deps()
    test.setup()
    #执行测试程序
    lptlog.info('''
               --------------------------------------------------------------
              +                第二步:执行测试...                           +
               --------------------------------------------------------------
''')
    test.run()
    #处理测试数据，生成result_list
    lptlog.info('''
               --------------------------------------------------------------
              +                第三步:读取测试数据，生成results列表...      +
               --------------------------------------------------------------
''')
    test.create_result()
    #保存测试数据到result.xml
    lptlog.info('''
               --------------------------------------------------------------
              +                第四步:results列表保存到result.xml...        +
               --------------------------------------------------------------
''')
    test.save_results_to_xml()
    #生成txt 测试报告
    lptlog.info('''
               --------------------------------------------------------------
              +                第五步:创建txt格式的测试报告...              +
               --------------------------------------------------------------
''')
   
    test.txt_report()
    
   #清除测试环境
    lptlog.info('''
               --------------------------------------------------------------
              +                第六步:清理测试环境...                       +
               --------------------------------------------------------------
''')
    if clean or tool == "glxgears":
        test.clean()
    else:
        lptlog.info("未清理测试环境")
